Revit 2027 API
RebarShapeConstraintAngleFromFixedDir Constructor
 Create an angular constraint.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarShapeConstraintAngleFromFixedDir(
	ElementId paramId,
	int sign,
	UV direction
)
Public Sub New (
	paramId As ElementId,
	sign As Integer,
	direction As UV
)
public:
RebarShapeConstraintAngleFromFixedDir(
	ElementId^ paramId,
	int sign,
	UV^ direction
)
new :
        paramId : ElementId *
        sign : int *
        direction : UV -> RebarShapeConstraintAngleFromFixedDir
Parameters
paramId ElementId
 A Rebar Shape parameter of type UT_Angle.
sign Int32
 The sign of the angle relative to the direction.
direction UV
 A fixed direction in UV-space.
Exceptions
Exception | Condition
ArgumentException |  sign is not 1 or -1. -or- paramId is not a valid Element identifier.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  direction has zero length.
See Also
Reference
RebarShapeConstraintAngleFromFixedDir Class
Autodesk.Revit.DB.Structure Namespace